app/controllers/document_registers_controller.rb

SELECT "document_registers".* FROM "document_registers"
---
  def index
    @document_registers = DocumentRegister.all