app/controllers/instrument_registrations_controller.rb

  def index
    @instrument_registrations = InstrumentRegistration.all
---
SELECT "instrument_registrations".* FROM "instrument_registrations"

  def create
    @instrument_registration = InstrumentRegistration.new(instrument_registration_params)

    respond_to do |format|
      if @instrument_registration.save
---
INSERT INTO "instrument_registrations" ("instrument_number", "internal_number", "extra_number", "object_agreement", "granting_organ", "linked_organ", "existence_im", "instituition_name", "value_transfer", "counterpart_value", "total", "signature_date", "end_date", "suspensive_date", "type", "address", "open_date", "organ", "user", "signature", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"

  def update
    respond_to do |format|
      if @instrument_registration.update(instrument_registration_params)
---
UPDATE "instrument_registrations" SET "internal_number" = $1, "extra_number" = $2, "object_agreement" = $3, "existence_im" = $4, "instrument_type" = $5, "updated_at" = $6 WHERE "instrument_registrations"."id" = $7  [["internal_number", 2323], ["extra_number", 2323], ["object_agreement", "2323"], ["existence_im", "Sim"], ["instrument_type", "Selecione"], ["updated_at", "2018-09-19 12:54:25.897461"], ["id", 46]]

  def destroy
    @instrument_registration.destroy
---
DELETE FROM "instrument_registrations" WHERE "instrument_registrations"."id" = $1  [["id", 1]]

    def set_instrument_registration
      @instrument_registration = InstrumentRegistration.find(params[:id])
---
SELECT  "instrument_registrations".* FROM "instrument_registrations" WHERE "instrument_registrations"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]